Revit 2027 API
EnergyDataSettings.BuildingType Property
 The type of building.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public gbXMLBuildingType BuildingType { get; set; }
Public Property BuildingType As gbXMLBuildingType
	Get
	Set
public:
property gbXMLBuildingType BuildingType {
	gbXMLBuildingType get ();
	void set (gbXMLBuildingType value);
}
member BuildingType : gbXMLBuildingType with get, set
Property Value
gbXMLBuildingType
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The building type does not fall within an appropriate range.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace